//已知(n+d)%23=p;   (n+d)%28=e;   (n+d)%33=i ,求n 
/*
已知(n+d)%23=p;   (n+d)%28=e;   (n+d)%33=i 
       使33×28×a被23除余1，用33×28×8=5544； 
       使23×33×b被28除余1，用23×33×19=14421； 
       使23×28×c被33除余1，用23×28×2=1288。 
      因此有（5544×p+14421×e+1288×i）% lcm(23,28,33) =n+d 
又23、28、33互质，即lcm(23,28,33)= 21252;
      所以有n=（5544×p+14421×e+1288×i-d）%21252
本题所求的是最小整数解，避免n为负，因此最后结果为n= [n+21252]% 21252
那么最终求解n的表达式就是：
n=(5544*p+14421*e+1288*i-d+21252)%21252*/
#include<iostream>
using namespace std;

int main(void)
{
	int p,e,i,d;
	int time=1;
	while(cin>>p>>e>>i>>d)
	{
		if(p==-1 && e==-1 && i==-1 && d==-1)
			break;

		int lcm=21252;  // lcm(23,28,33)
		int n=(5544*p+14421*e+1288*i-d+21252)%21252;
		if(n==0)
			n=21252;
		cout<<"Case "<<time++<<": the next triple peak occurs in "<<n<<" days."<<endl;
	}
	return 0;
}